app/Controllers/HomeController.php

SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows` FROM `categories`
SELECT COUNT(*) AS `numrows` FROM `users`
---
    public function index()
    {
        // Get real-time dashboard data
        $dashboardData = $this->realtimeService->getDashboardData();

        $data = [
            'title' => 'Dashboard',
            'subTitle' => 'Welcome to RMB Store Admin Dashboard',
            'totalProducts' => $this->productModel->countAll(),
            'totalCategories' => $this->categoryModel->countAll(),
            'totalUsers' => $this->userModel->countAll(),
            'todaySales' => $dashboardData['today_sales'],
            'recentSales' => $dashboardData['recent_sales'],
            'topDailyClosings' => $dashboardData['top_daily_closings'],
            'storeStatus' => $dashboardData['store_status'],
            'lastUpdated' => $dashboardData['last_updated'],
        ];