app/Models/SaleModel.php

SELECT COUNT(*) AS `numrows`
FROM `daily_closings`
WHERE `closing_date` = '2025-08-19'
SELECT COUNT(*) as total_transactions, SUM(total_amount) as total_sales, SUM(CASE WHEN payment_method = "cash" THEN total_amount ELSE 0 END) as cash_sales, SUM(CASE WHEN payment_method = "card" THEN total_amount ELSE 0 END) as card_sales, SUM(CASE WHEN payment_method = "bank_transfer" THEN total_amount ELSE 0 END) as bank_transfer_sales, SUM(CASE WHEN payment_method = "online" THEN total_amount ELSE 0 END) as online_sales, SUM(discount_amount) as total_discounts, SUM(tax_amount) as total_tax
FROM `sales`
WHERE DATE(created_at) = '2025-08-19'
---
    public function getSalesSummaryForDate($date)
    {
        // Check if this date has been closed
        $dailyClosingModel = new \App\Models\DailyClosingModel();
        $isDateClosed = $dailyClosingModel->where('closing_date', $date)->countAllResults() > 0;

        // If date is closed, return zero values
        if ($isDateClosed) {
            return [
                'total_transactions' => 0,
                'total_sales' => 0,
                'cash_sales' => 0,
                'card_sales' => 0,
                'bank_transfer_sales' => 0,
                'online_sales' => 0,
                'total_discounts' => 0,
                'total_tax' => 0
            ];
        }

        $result = $this->select('
            COUNT(*) as total_transactions,
            SUM(total_amount) as total_sales,
            SUM(CASE WHEN payment_method = "cash" THEN total_amount ELSE 0 END) as cash_sales,
            SUM(CASE WHEN payment_method = "card" THEN total_amount ELSE 0 END) as card_sales,
            SUM(CASE WHEN payment_method = "bank_transfer" THEN total_amount ELSE 0 END) as bank_transfer_sales,
            SUM(CASE WHEN payment_method = "online" THEN total_amount ELSE 0 END) as online_sales,
            SUM(discount_amount) as total_discounts,
            SUM(tax_amount) as total_tax
        ')
        ->where('DATE(created_at)', $date)
        ->get()
        ->getRowArray();

SELECT `closing_date`
FROM `daily_closings`
SELECT `id`, `sale_number`, `customer_name`, `total_amount`, `payment_method`, `created_at`
FROM `sales`
WHERE DATE(created_at) NOT IN ('2025-08-18')
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getRecentSales($limit = 10)
    {
        // Get all closed dates
        $dailyClosingModel = new \App\Models\DailyClosingModel();
        $closedDates = $dailyClosingModel->select('closing_date')->findAll();
        $closedDateList = array_column($closedDates, 'closing_date');

        $builder = $this->select('id, sale_number, customer_name, total_amount, payment_method, created_at')
                       ->orderBy('created_at', 'DESC');

        // Exclude sales from closed dates
        if (!empty($closedDateList)) {
            $builder->whereNotIn('DATE(created_at)', $closedDateList);
        }

        return $builder->limit($limit)->findAll();