app/Models/SettingsModel.php

SELECT *
FROM `settings`
 LIMIT 1
---
    public function getSettings()
    {
        return $this->first();